Repository: ApolloZhangOnGithub/cnb
Catalog: tools/cnb-mac-companion/Sources/CNBMacCompanion/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

# action.open_cnb_home
source: 打开 ~/.cnb
en: Open ~/.cnb

# action.open_companion
source: 打开 CNB Companion
en: Open CNB Companion

# action.open_folder
source: 打开文件夹
en: Open Folder

# action.open_terminal
source: 打开终端
en: Open Terminal

# action.quit_companion
source: 退出 CNB Companion
en: Quit CNB Companion

# action.reveal_board
source: 显示看板文件
en: Reveal Board

# feishu.action.reload_config
source: 重载配置
en: Reload Config

# feishu.action.save
source: 保存
en: Save

# feishu.action.send
source: 发送
en: Send

# feishu.chat.title
source: 飞书对话
en: Feishu Chat

# feishu.chat.welcome
source: 已连接到 Mac companion。配置飞书机器人和 chat_id 后，可以直接把消息发到飞书，并可选通知 CNB bridge 交给设备主管处理。
en: Connected to the Mac companion. Configure the Feishu bot and chat ID to send messages to Feishu, with optional CNB bridge notification for the device supervisor.

# feishu.composer.placeholder
source: 给飞书发消息...
en: Message Feishu...

# feishu.delivery.failed
source: 失败
en: Failed

# feishu.delivery.local
source: 本地
en: Local

# feishu.delivery.sending
source: 发送中
en: Sending

# feishu.delivery.sent
source: 已发送
en: Sent

# feishu.history.load_more
source: 加载更早消息
en: Load earlier messages

# feishu.history.loading
source: 正在加载历史...
en: Loading history...

# feishu.history.no_more
source: 没有更多历史
en: No earlier history

# feishu.settings.hint
source: 使用机器人身份。机器人必须在目标群内并具备消息权限；Webhook URL 可选，用来通知本机 CNB bridge。
en: Bot identity is used. The bot must be in the target chat and have message scopes; Webhook URL is optional for notifying the local CNB bridge.

# feishu.settings.reply_message_id
source: 回复消息 ID
en: Reply message ID

# feishu.settings.title
source: 飞书连接
en: Feishu Connection

# feishu.settings.verification_token
source: 校验 Token
en: Verification Token

# feishu.status.failed
source: 失败：%@
en: Failed: %@

# feishu.status.needs_settings
source: 需要配置飞书
en: Feishu settings required

# feishu.status.ready
source: 已就绪
en: Ready

# feishu.status.refreshed
source: 已刷新 %d 条消息
en: Refreshed %d messages

# feishu.status.refreshing
source: 刷新中...
en: Refreshing...

# feishu.status.saved
source: 已保存
en: Saved

# feishu.status.sending
source: 发送中...
en: Sending...

# feishu.status.sent
source: 已发送：%@
en: Sent: %@

# feishu.status.sent_with_bridge
source: 已发送并通知 bridge：%@
en: Sent and notified bridge: %@

# feishu.status.loaded_older
source: 已加载 %d 条历史消息
en: Loaded %d earlier messages

# feishu.status.synced
source: 已同步 %d 项消息更新
en: Synced %d message changes

# feishu.tui.action.open_browser
source: 在浏览器打开
en: Open in Browser

# feishu.tui.action.reload
source: 重载
en: Reload

# feishu.tui.error.cnb_not_found
source: 找不到 cnb 命令
en: cnb command was not found

# feishu.tui.error.launch_failed
source: 无法启动只读 Web TUI
en: Could not start the read-only Web TUI

# feishu.tui.error.no_available_ports
source: %d-%d 端口都不可用
en: Ports %d-%d are unavailable

# feishu.tui.error.port_unavailable
source: %d 端口不可用
en: Port %d is unavailable

# feishu.tui.error.server_not_ready
source: %d 端口上的 TUI 服务没有就绪
en: The TUI service on port %d did not become ready

# feishu.tui.loading.title
source: 正在连接只读 Web TUI
en: Connecting to the read-only Web TUI

# feishu.tui.status.checking_port
source: 检查 %d 端口...
en: Checking port %d...

# feishu.tui.status.failed
source: 失败：%@
en: Failed: %@

# feishu.tui.status.idle
source: 未连接
en: Not connected

# feishu.tui.status.port_busy
source: %d 已被占用，切换下一个端口...
en: Port %d is busy, trying the next one...

# feishu.tui.status.ready
source: 已连接：%@
en: Connected: %@

# feishu.tui.status.starting_port
source: 启动本机 viewer：%d...
en: Starting local viewer on %d...

# feishu.tui.status.starting
source: 启动中...
en: Starting...

# column.last_active
source: 最近活动
en: Last Active

# column.pending
source: 待处理
en: Pending

# column.project
source: 项目
en: Project

# column.sessions
source: 会话
en: Sessions

# column.status
source: 状态
en: Status

# column.tasks
source: 任务
en: Tasks

# column.unread
source: 未读
en: Unread

# empty.no_boards.description
source: 注册或打开一个 cnb 项目后，这里会显示状态。
en: Register or open a cnb project to populate this view.

# empty.no_boards.title
source: 没有 CNB 看板
en: No CNB Boards

# metric.active
source: 进行中
en: Active

# metric.blocked
source: 阻塞
en: Blocked

# metric.no_board
source: 无看板
en: No Board

# metric.pending
source: 待处理
en: Pending

# metric.projects
source: 项目
en: Projects

# metric.queued
source: 排队
en: Queued

# metric.sessions
source: 会话
en: Sessions

# metric.stale
source: 失效
en: Stale

# metric.tasks
source: 任务
en: Tasks

# metric.unread
source: 未读
en: Unread

# nav.feishu_chat
source: 飞书对话
en: Feishu Chat

# nav.feishu_tui
source: 飞书 TUI
en: Feishu TUI

# nav.feature_switcher
source: 切换功能
en: Switch feature

# nav.overview
source: 总览
en: Overview

# nav.settings
source: 设置
en: Settings

# overview.action.open_top_project
source: 打开 %@
en: Open %@

# overview.action.refresh
source: 刷新状态
en: Refresh Status

# overview.filter.all
source: 全部
en: All

# overview.filter.attention
source: 需处理
en: Needs Attention

# overview.filter.showing
source: 当前显示：%@
en: Showing: %@

# overview.filter.smart
source: 智能
en: Smart

# project.reason.blocked
source: %d 个阻塞会话
en: %d blocked session(s)

# project.reason.idle
source: 未运行
en: Not running

# project.reason.no_board
source: 已注册，但没有看板
en: Registered, no board found

# project.reason.pending
source: %d 个待处理操作
en: %d pending action(s)

# project.reason.sessions
source: %d 个会话
en: %d session(s)

# project.reason.tasks
source: %d 个任务
en: %d active task(s)

# project.reason.unread
source: %d 条未读消息
en: %d unread message(s)

# project.summary
source: %d 待处理，%d 任务，%d 未读
en: %d pending, %d tasks, %d unread

# section.actions
source: 操作
en: Actions

# section.projects
source: 项目
en: Projects

# section.suggested_commands
source: 建议命令
en: Suggested Commands

# snapshot.detail
source: %d 待处理，%d 任务，%d 未读
en: %d pending, %d tasks, %d unread

# snapshot.detail.empty
source: 未找到带看板的本地 cnb 项目
en: No local cnb project with a board was found

# snapshot.refreshed
source: %@ - %@ 刷新
en: %@ - refreshed %@

# snapshot.title.active
source: %@ 运行中
en: %@ active

# snapshot.title.attention
source: %@ 需要处理
en: %@ needs attention

# snapshot.title.quiet
source: CNB 安静
en: CNB quiet

# status.attention
source: 需要处理
en: Needs Attention

# status.blocked
source: 阻塞
en: Blocked

# status.idle
source: 未运行
en: Idle

# status.no_board
source: 无看板
en: No Board

# status.quiet
source: 安静
en: Quiet

# status.updating
source: 更新中
en: Updating

# status.working
source: 运行中
en: Working

# time.never
source: 从未
en: never
